#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
terraform
module.vpc.data.aws_availability_zones.available: Reading...
module.jenkins.data.aws_availability_zones.available: Reading...
module.jenkins.data.aws_ami.amazon_linux_2023_arm: Reading...
module.jenkins.aws_key_pair.jenkins: Refreshing state... [id=jenkins-key]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02176cc2b17f10ac5]
aws_s3_bucket.state: Refreshing state... [id=cloud-infra-terraform-state-bucket]
module.jenkins.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.jenkins.aws_ebs_volume.jenkins_data: Refreshing state... [id=vol-09a2acbf10fb8c4ec]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.jenkins.data.aws_ami.amazon_linux_2023_arm: Read complete after 1s [id=ami-04b3ea741d7536e79]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d2c50d4f02ce26e0]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0787e134f4aa8d918]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0499d32a8a226e86e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06b610272e2b34b4e]
module.jenkins.aws_security_group.jenkins_sg: Refreshing state... [id=sg-0331187cc7f84949e]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c067046be802feb1]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a43c693759d3cf49]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-022b77f673c445d3f]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-082172c48cbc5ab4f]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9c9cfeb60422ac0]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-037de9d5c17ca3808]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d4c8014d9bc83a50]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0994ec98753d4e0c8]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09782fe43aeb61090]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a43c693759d3cf491080289494]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-090360aa4ce73813e]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0eb25619823d1aa49]
module.jenkins.aws_instance.jenkins: Refreshing state... [id=i-0db5134e5e5ae7e9a]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-082306372813bdc6b]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-073eedd1fefb3384b]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-041557b84bbde764b]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d4a6795edb688037]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0787e134f4aa8d9181080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-022b77f673c445d3f1080289494]
module.jenkins.aws_volume_attachment.jenkins_data: Refreshing state... [id=vai-607496234]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.jenkins.aws_instance.jenkins must be replaced
-/+ resource "aws_instance" "jenkins" {
      ~ ami                                  = "ami-06aaef1e7c0d81331" -> "ami-04b3ea741d7536e79" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-central-1:339051025574:instance/i-0db5134e5e5ae7e9a" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-central-1a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0db5134e5e5ae7e9a" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-04b71162a9d6d2f18" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-220.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.220" -> (known after apply)
      ~ public_dns                           = "ec2-3-70-246-32.eu-central-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.70.246.32" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "jenkins"
            "Project"     = "cloud-infra"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:eu-central-1:339051025574:key/0a6c565d-6d48-42f4-8b0e-e9b405080580" -> null
          - tags                  = {
              - "Environment" = "production"
              - "ManagedBy"   = "terraform"
              - "Name"        = "jenkins-data"
              - "Project"     = "cloud-infra"
            } -> null
          - tags_all              = {
              - "Environment" = "production"
              - "ManagedBy"   = "terraform"
              - "Name"        = "jenkins-data"
              - "Project"     = "cloud-infra"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-09a2acbf10fb8c4ec" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-04b71162a9d6d2f18" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-04092538399a35a7e" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.jenkins.aws_volume_attachment.jenkins_data must be replaced
-/+ resource "aws_volume_attachment" "jenkins_data" {
      ~ id          = "vai-607496234" -> (known after apply)
      ~ instance_id = "i-0db5134e5e5ae7e9a" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ jenkins_instance_id       = "i-0db5134e5e5ae7e9a" -> (known after apply)
  ~ jenkins_public_ip         = "3.70.246.32" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Artyom-K-Dev, Action: `pull_request`*